In [2]:
import pandas 
pandas.__version__

'1.2.4'

# Introducing Pandas Objects

In [3]:
import numpy as np
import pandas as pd

In [4]:
c = pd.Series([632,1638,569,115])
c

0     632
1    1638
2     569
3     115
dtype: int64

In [6]:
c.values

array([ 632, 1638,  569,  115], dtype=int64)

In [7]:
c.index

RangeIndex(start=0, stop=4, step=1)

In [8]:
B=pd.Series([632,1638,569,115],index=['Firmicutes','Proteobacteria','Actinobacteria','Bacteroidetes'])

B

Firmicutes         632
Proteobacteria    1638
Actinobacteria     569
Bacteroidetes      115
dtype: int64

In [9]:
B['Actinobacteria']

569

In [10]:
B[0]

632

In [11]:
B.name='counts'
B.index.name='phylum'
B

phylum
Firmicutes         632
Proteobacteria    1638
Actinobacteria     569
Bacteroidetes      115
Name: counts, dtype: int64

In [12]:
np.log(B)

phylum
Firmicutes        6.448889
Proteobacteria    7.401231
Actinobacteria    6.343880
Bacteroidetes     4.744932
Name: counts, dtype: float64

In [13]:
B[B>1000]

phylum
Proteobacteria    1638
Name: counts, dtype: int64

In [14]:
B_dict={'Firmicutes':632,'Proteobacteria':1500,'Actinobacteria':850,'Bacteroidetes':200}
print(B_dict)
pd.Series(B_dict)

{'Firmicutes': 632, 'Proteobacteria': 1500, 'Actinobacteria': 850, 'Bacteroidetes': 200}

Firmicutes         632
Proteobacteria    1500
Actinobacteria     850
Bacteroidetes      200
dtype: int64

In [17]:
d={"Province":["FL","FL","NH","NH","ZH"],
   "Year":[2013,2014,2013,2014,2014],
   "Literacy":[0.2,0.1,0.5,0.3,0.5]}
print(d)
d=pd.DataFrame(d)
d

{'Province': ['FL', 'FL', 'NH', 'NH', 'ZH'], 'Year': [2013, 2014, 2013, 2014, 2014], 'Literacy': [0.2, 0.1, 0.5, 0.3, 0.5]}

  Province  Year  Literacy
0       FL  2013       0.2
1       FL  2014       0.1
2       NH  2013       0.5
3       NH  2014       0.3
4       ZH  2014       0.5

In [26]:
df=pd.DataFrame(d,columns=["Year", "Province", "Literacy"])
df

   Year Province  Literacy
0  2013       FL       0.2
1  2014       FL       0.1
2  2013       NH       0.5
3  2014       NH       0.3
4  2014       ZH       0.5

In [27]:
df['nonsense']=df.Year/df.Literacy
df

   Year Province  Literacy      nonsense
0  2013       FL       0.2  10065.000000
1  2014       FL       0.1  20140.000000
2  2013       NH       0.5   4026.000000
3  2014       NH       0.3   6713.333333
4  2014       ZH       0.5   4028.000000

In [29]:
df['Serie_aligned']=pd.Series(range(5),index=[0,1,2,3,4])
df

   Year Province  Literacy      nonsense  Serie_aligned
0  2013       FL       0.2  10065.000000              0
1  2014       FL       0.1  20140.000000              1
2  2013       NH       0.5   4026.000000              2
3  2014       NH       0.3   6713.333333              3
4  2014       ZH       0.5   4028.000000              4

In [30]:
df.to_dict()

{'Year': {0: 2013, 1: 2014, 2: 2013, 3: 2014, 4: 2014},
 'Province': {0: 'FL', 1: 'FL', 2: 'NH', 3: 'NH', 4: 'ZH'},
 'Literacy': {0: 0.2, 1: 0.1, 2: 0.5, 3: 0.3, 4: 0.5},
 'nonsense': {0: 10065.0,
  1: 20140.0,
  2: 4026.0,
  3: 6713.333333333334,
  4: 4028.0},
 'Serie_aligned': {0: 0, 1: 1, 2: 2, 3: 3, 4: 4}}

In [32]:
pd.DataFrame(df.to_dict())

   Year Province  Literacy      nonsense  Serie_aligned
0  2013       FL       0.2  10065.000000              0
1  2014       FL       0.1  20140.000000              1
2  2013       NH       0.5   4026.000000              2
3  2014       NH       0.3   6713.333333              3
4  2014       ZH       0.5   4028.000000              4

In [33]:
da= [{'a':i,'b':10*i}for i in range(6)]
print(da)
pd.DataFrame(da)

[{'a': 0, 'b': 0}, {'a': 1, 'b': 10}, {'a': 2, 'b': 20}, {'a': 3, 'b': 30}, {'a': 4, 'b': 40}, {'a': 5, 'b': 50}]

   a   b
0  0   0
1  1  10
2  2  20
3  3  30
4  4  40
5  5  50

In [34]:
pd.DataFrame([{'aa':1,'bb':2},{'bb':3,'cc':6}])

    aa  bb   cc
0  1.0   2  NaN
1  NaN   3  6.0

In [37]:
pd.DataFrame(np.random.randint(2,12),columns=['abc','xyz'],index=['a','b','c'])

   abc  xyz
a    7    7
b    7    7
c    7    7

In [42]:
i=pd.Index([20,34,57,1,8])
i

Int64Index([20, 34, 57, 1, 8], dtype='int64')

In [43]:
i[1]

34

In [44]:
i[::]

Int64Index([20, 34, 57, 1, 8], dtype='int64')

``Index`` objects also have many of the attributes familiar from NumPy arrays:

In [45]:
print(i.size,i.shape,i.ndim,i.dtype)

5 (5,) 1 int64

In [46]:
i[1]=0

TypeError: Index does not support mutable operations

# Operating on Data in Pandas

In [47]:
rng=np.random.RandomState(10)
ser= pd.Series(rng.randint(0,10,4))
ser

0    9
1    4
2    0
3    1
dtype: int32

In [48]:
dfr=pd.DataFrame(rng.randint(0,10,(5,4)),
                columns=['W','X','Y','Z'])
dfr

   W  X  Y  Z
0  9  0  1  8
1  9  0  8  6
2  4  3  0  4
3  6  8  1  8
4  4  1  3  6

If we apply a NumPy ufunc on either of these objects, the result will be another Pandas object *with the indices preserved:*

In [49]:
np.exp(ser)

0    8103.083928
1      54.598150
2       1.000000
3       2.718282
dtype: float64

Or, for a slightly more complex calculation:

In [50]:
np.sin(dfr*np.pi/4)

              W             X             Y             Z
0  7.071068e-01  0.000000e+00  7.071068e-01 -2.449294e-16
1  7.071068e-01  0.000000e+00 -2.449294e-16 -1.000000e+00
2  1.224647e-16  7.071068e-01  0.000000e+00  1.224647e-16
3 -1.000000e+00 -2.449294e-16  7.071068e-01 -2.449294e-16
4  1.224647e-16  7.071068e-01  7.071068e-01 -1.000000e+00

## Universal Functions: Index Alignment

For binary operations on two ``Series`` or ``DataFrame`` objects, Pandas will align indices in the process of performing the operation.
This is very convenient when working with incomplete data, as we'll see in some of the examples that follow.

In [51]:
a = pd.Series({'Alaska':172337,'Texas':695896,'California':423967},
             name='area')
p=pd.Series({'California':38332521,'Texas':69854578,'Newyork':2345678},name='population')
print(a)
p

Alaska        172337
Texas         695896
California    423967
Name: area, dtype: int64

California    38332521
Texas         69854578
Newyork        2345678
Name: population, dtype: int64

Let's see what happens when we divide these to compute the population density:

In [52]:
p/a

Alaska               NaN
California     90.413926
Newyork              NaN
Texas         100.380772
dtype: float64

The resulting array contains the *union* of indices of the two input arrays, which could be determined using standard Python set arithmetic on these indices:

In [53]:
a.index | p.index

<ipython-input-53-8258ebbce49f>:1: FutureWarning: Index.__or__ operating as a set operation is deprecated, in the future this will be a logical operation matching Series.__or__.  Use index.union(other) instead
  a.index | p.index

Index(['Alaska', 'California', 'Newyork', 'Texas'], dtype='object')

In [54]:
X=pd.Series([2,4,6],index=[0,1,2])
Y=pd.Series([1,3,5],index=[1,2,3])
print(X)
print(Y)
Y
X + Y

0    2
1    4
2    6
dtype: int64
1    1
2    3
3    5
dtype: int64

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

In [55]:
X.add(Y,fill_value=0)

0    2.0
1    5.0
2    9.0
3    5.0
dtype: float64

In [56]:
df

   Year Province  Literacy      nonsense  Serie_aligned
0  2013       FL       0.2  10065.000000              0
1  2014       FL       0.1  20140.000000              1
2  2013       NH       0.5   4026.000000              2
3  2014       NH       0.3   6713.333333              3
4  2014       ZH       0.5   4028.000000              4

In [57]:
df2=pd.DataFrame({"Province":["FL","NH","ZH"],"Population":["100000","200000","300000"]})
df2

  Province Population
0       FL     100000
1       NH     200000
2       ZH     300000

Let's say we want a dataset with year, literacy, province and population. We can create it from `df` and `df2`.

In [59]:
  # merge is smart! If there are overlapping names, it uses those for the merge
df.merge(df2)

   Year Province  Literacy      nonsense  Serie_aligned Population
0  2013       FL       0.2  10065.000000              0     100000
1  2014       FL       0.1  20140.000000              1     100000
2  2013       NH       0.5   4026.000000              2     200000
3  2014       NH       0.3   6713.333333              3     200000
4  2014       ZH       0.5   4028.000000              4     300000

If the column names are different, you need to specify them explicitely

In [66]:
df3=pd.DataFrame({"province":["FL","NH"],"Population":["100000","200000"]})
df3
df.merge(df3,right_on='province',left_on='Province')

   Year Province  Literacy      nonsense  Serie_aligned province Population
0  2013       FL       0.2  10065.000000              0       FL     100000
1  2014       FL       0.1  20140.000000              1       FL     100000
2  2013       NH       0.5   4026.000000              2       NH     200000
3  2014       NH       0.3   6713.333333              3       NH     200000

What happened? Zuid Holland is weg!

By default `merge` does inner joins. If you want a different type of join, you can specify it.

In [69]:
df4=pd.DataFrame({"Province":["FL","NH","UT"],
                  "Population":["100000","300000","400000"]})
df.merge(df4,how='outer')

     Year Province  Literacy      nonsense  Serie_aligned Population
0  2013.0       FL       0.2  10065.000000            0.0     100000
1  2014.0       FL       0.1  20140.000000            1.0     100000
2  2013.0       NH       0.5   4026.000000            2.0     300000
3  2014.0       NH       0.3   6713.333333            3.0     300000
4  2014.0       ZH       0.5   4028.000000            4.0        NaN
5     NaN       UT       NaN           NaN            NaN     400000

Check this out:

In [70]:
df5=pd.DataFrame({"Province":["FL","NH","FL"],"Population":["100000","300000","400000"]})
print(df)
df.merge(df5,how='outer')

   Year Province  Literacy      nonsense  Serie_aligned
0  2013       FL       0.2  10065.000000              0
1  2014       FL       0.1  20140.000000              1
2  2013       NH       0.5   4026.000000              2
3  2014       NH       0.3   6713.333333              3
4  2014       ZH       0.5   4028.000000              4

   Year Province  Literacy      nonsense  Serie_aligned Population
0  2013       FL       0.2  10065.000000              0     100000
1  2013       FL       0.2  10065.000000              0     400000
2  2014       FL       0.1  20140.000000              1     100000
3  2014       FL       0.1  20140.000000              1     400000
4  2013       NH       0.5   4026.000000              2     300000
5  2014       NH       0.3   6713.333333              3     300000
6  2014       ZH       0.5   4028.000000              4        NaN

In [74]:
series_a=pd.Series([np.nan,2.5,np.nan,3.5,4.5,np.nan],
                   index=['a','b','c','d','e','f'])
series_b=pd.Series(np.arange(len(series_a),dtype=np.float64),
                    index=['a','b','c','d','e','f'])

In [75]:
series_a

a    NaN
b    2.5
c    NaN
d    3.5
e    4.5
f    NaN
dtype: float64

In [76]:
series_b

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
f    5.0
dtype: float64

In [77]:
pd.Series(np.where(pd.isnull(series_a),series_b,series_a),
          index=series_a.index)

a    0.0
b    2.5
c    2.0
d    3.5
e    4.5
f    5.0
dtype: float64

In [78]:
series_a.combine_first(series_b)

a    0.0
b    2.5
c    2.0
d    3.5
e    4.5
f    5.0
dtype: float64